JadyXuan/ESPclaw/eyes/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Arduino support
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ARDUINO_LOOP_STACK_SIZE=16384

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# USB CDC for serial output
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition table (with enough app space)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# JC8048W550 boards usually ship with 16MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Increase task watchdog to 10s (RGB LCD init is slow)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Halt on panic instead of reboot — shows backtrace in serial monitor
# Remove this line after debugging is done
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
